[Katana_CV X2WeaponTemplate]
FriendlyName="Katana"
FriendlyNamePlural="Katana"
BriefSummary="Katana"
TacticalText="This alternate blade of asian origin is lighter than the sword. It cuts through armor, but the reduced weight does less damage.\n3 armor pierce, 0 shred"
AbilityDescName="Katana"

[Katana_MG X2WeaponTemplate]
FriendlyName="Energy Katana"
FriendlyNamePlural="Energy Katana"
BriefSummary="Energy Katana"
TacticalText="A steel katana won't cut it against the aliens. This experimental blade is infused with energy.\n4 armor pierce, 1 shred"
AbilityDescName="Energy Katana"

[Katana_BM X2WeaponTemplate]
FriendlyName="Plasma Katana"
FriendlyNamePlural="Plasma Katana"
BriefSummary="Plasma Katana"
TacticalText="The last iteration of the energy infused blade, this katana can cut through armor like butter.\n5 armor pierce and 2 shred"
AbilityDescName="Plasma Katana"

[Wakizashi_CV X2WeaponTemplate]
FriendlyName="Wakizashi"
FriendlyNamePlural="Wakizashi"
BriefSummary="Wakizashi"
TacticalText="The small cousin of the katana, loses the extra crit rate of the katana but adds mobility."
AbilityDescName="Wakizashi"

[Wakizashi_MG X2WeaponTemplate]
FriendlyName="Energy Wakizashi"
FriendlyNamePlural="Energy Wakizashi"
BriefSummary="Energy Wakizashi"
TacticalText="This smaller variation of the Energy katana trades a bit of damage for mobility.\n1 armor pierce, 1 shred"
AbilityDescName="Energy Wakizashi"

[Wakizashi_BM X2WeaponTemplate]
FriendlyName="Plasma Wakizashi"
FriendlyNamePlural="Plasma Wakizashi"
BriefSummary="Plasma Wakizashi"
TacticalText="The ultimate small weapon. Trades a bit of damage for mobility.\n2 armor pierce, 2 shred"
AbilityDescName="Plasma Wakizashi"

[Ninjato_CV X2WeaponTemplate]
FriendlyName="Ninjato"
FriendlyNamePlural="Ninjato"
BriefSummary="Ninjato"
TacticalText="Ninjato are straight-bladed weapons that the ninja of feudal Japan are said to have carried.\n1 armor pierce, 0 shred"
AbilityDescName="Ninjato"

[Ninjato_MG X2WeaponTemplate]
FriendlyName="Toxic Ninjato"
FriendlyNamePlural="Toxic Ninjato"
BriefSummary="Toxic Ninjato"
TacticalText="The Toxic Ninjato sport a small tank of synthesized viper toxin in the handle that is transfered to the victim on a successful hit.\n2 armor pierce, 0 shred"
AbilityDescName="Toxic Ninjato"

[Ninjato_BM X2WeaponTemplate]
FriendlyName="Doom Ninjato"
FriendlyNamePlural="Doom Ninjato"
BriefSummary="Doom Ninjato"
TacticalText="The Doom Ninjato was designed to strike despair in the heart of our enemies. It injects a highly psychotropic substance in the blood circle of our opressors that make them flee in terror.\n3 armor pierce, 0 shred"
AbilityDescName="Doom Ninjato"

[VortexNinjato_BM X2WeaponTemplate]
FriendlyName="Vortex Ninjato"
FriendlyNamePlural="Vortex Ninjato"
BriefSummary="Vortex Ninjato"
TacticalText="Research on the codex brain made it possible to incorporate the codex teleport ability into our close combat weapon design.\n3 armor pierce, 0 shred"
AbilityDescName="Vortex Ninjato"

[VortexKatana_BM X2WeaponTemplate]
FriendlyName="Vortex Katana"
FriendlyNamePlural="Vortex Katana"
BriefSummary="Vortex Katana"
TacticalText="Research on the codex brain made it possible to incorporate the codex teleport ability into our close combat weapon design.\n5 armor pierce, 2 shred"
AbilityDescName="Vortex Katana"

[VortexWakizashi_BM X2WeaponTemplate]
FriendlyName="Vortext Wakizashi"
FriendlyNamePlural="Vortext Wakizashi"
BriefSummary="Vortext Wakizashi"
TacticalText="Research on the codex brain made it possible to incorporate the codex teleport ability into our close combat weapon design.\n2 armor pierce, 2 shred"
AbilityDescName="Vortex Wakizashi"

[MusashiLightningStrikeT1 X2AbilityTemplate]
LocFriendlyName="Lightning Slash"
LocLongDescription="Attack any enemy within blue movement range with your <Ability:SecondaryWeaponName/>. This attack does not cost an action point."
LocHelpText="Attack any enemy within blue movement range with your <Ability:SecondaryWeaponName/>. This attack does not cost an action point."
LocPromotionPopupText="<Bullet/>Attack any enemy within blue movement range with your <Ability:SecondaryWeaponName/>. This attack does not cost an action point.<br/>"

[MusashiLightningStrikeT2 X2AbilityTemplate]
LocFriendlyName="Lightning Slash"
LocLongDescription="Attack any enemy within blue movement range with your <Ability:SecondaryWeaponName/>. This attack does not cost an action point."
LocHelpText="Attack any enemy within blue movement range with your <Ability:SecondaryWeaponName/>. This attack does not cost an action point."
LocPromotionPopupText="<Bullet/>Attack any enemy within blue movement range with your <Ability:SecondaryWeaponName/>. This attack does not cost an action point.<br/>"

[MusashiLightningStrikeT3 X2AbilityTemplate]
LocFriendlyName="Lightning Slash"
LocLongDescription="Attack any enemy within blue movement range with your <Ability:SecondaryWeaponName/>. This attack does not cost an action point."
LocHelpText="Attack any enemy within blue movement range with your <Ability:SecondaryWeaponName/>. This attack does not cost an action point."
LocPromotionPopupText="<Bullet/>Attack any enemy within blue movement range with your <Ability:SecondaryWeaponName/>. This attack does not cost an action point.<br/>"

[MusashiNinjatoSilentTakedownT1 X2AbilityTemplate]
LocFriendlyName="Silent Takedown"
LocLongDescription="You can silently takedown your enemies. When activated you have no detection radius for one round. Melee kills do not break your concealment and you have +20 critical hit chance and +3 critical damage (melee only). Can only be activated while concealed."
LocHelpText="<Bullet/>You have no detection radius for one round (XCOM and alien turn).\n<Bullet\>Melee kills do not break your concealment.\n<Bullet\>+20 critical hit chance and +3 critical damage (melee only).\n<Bullet\>Can only be activated while concealed.\n<Bullet\>Grants 1 charges.\n<Bullet\><Ability:SelfCooldown> turn cooldown."
LocFlyOverText="Silent Takedown" 
LocPromotionPopupText="You can silently takedown your enemies. When activated you have no detection radius for one round. Melee kills do not break your concealment and you have +20 critical hit chance and +3 critical damage (melee only). Can only be activated while concealed."

[MusashiNinjatoSilentTakedownT2 X2AbilityTemplate]
LocFriendlyName="Silent Takedown"
LocLongDescription="You can silently takedown your enemies. When activated you have no detection radius for one round. Melee kills do not break your concealment and you have +30 critical hit chance and +4 critical damage (melee only). Can only be activated while concealed."
LocHelpText="<Bullet/>You have no detection radius for one round (XCOM and alien turn).\n<Bullet\>Melee kills do not break your concealment.\n<Bullet\>+30 critical hit chance and +4 critical damage (melee only).\n<Bullet\>Can only be activated while concealed.\n<Bullet\>Grants 2 charges.\n<Bullet\><Ability:SelfCooldown> turn cooldown."
LocFlyOverText="Silent Takedown" 
LocPromotionPopupText="You can silently takedown your enemies. When activated you have no detection radius for one round. Melee kills do not break your concealment and you have +30 critical hit chance and +4 critical damage (melee only). Can only be activated while concealed."

[MusashiNinjatoSilentTakedownT3 X2AbilityTemplate]
LocFriendlyName="Silent Takedown"
LocLongDescription="You can silently takedown your enemies. When activated you have no detection radius for one round. Melee kills do not break your concealment and you have +40 critical hit chance and +5 critical damage (melee only). Can only be activated while concealed."
LocHelpText="<Bullet/>You have no detection radius for one round (xcom and alien turn).\n<Bullet\>Melee kills do not break your concealment.\n<Bullet\>+40 critical hit chance and +5 critical damage (melee only).\n<Bullet\>Can only be activated while concealed.\n<Bullet\><Ability:SelfCooldown> turn cooldown."
LocFlyOverText="Silent Takedown" 
LocPromotionPopupText="You can silently takedown your enemies. When activated you have no detection radius for one round. Melee kills do not break your concealment and you have +40 critical hit chance and +5 critical damage (melee only). Can only be activated while concealed."

[MusashiVoidStrike X2AbilityTemplate]
LocFriendlyName="Void Strike"
LocLongDescription="Teleport to your enemy for a devastating melee attack that ignores armor and shields. If you are under the effect of silent takedown the attack does not increase your suspicion level."
LocHelpText="<Bullet/>Ignores armor and shields.\n<Bullet\>Does not raise suspicion.\n<Bullet\>In combination with the Reaper perk, refunds two action points instead of one after successful Reaper kill\n<Bullet\>Cooldown is bypassed if you score a critical hit or reaper is active\n<Bullet\>Void Strike does not trigger overwatch or reaction fire\n<Bullet\><Ability:SelfCooldown> turn cooldown."
LocFlyOverText="Void Strike" 
LocPromotionPopupText="Teleport to your enemy for a devastating melee attack that ignores armor and shields. If you are under the effect of silent takedown the attack does not increase your suspicion level."

[MusashiSpiderSuit X2AbilityTemplate]
LocFriendlyName="Spider"
LocLongDescription=""
LocHelpText=""
LocFlyOverText="Spider" 
LocPromotionPopupText=""

[KatanaSpeedBonus X2AbilityTemplate]
LocFriendlyName="KatanaSpeedBonus"
LocLongDescription=""
LocHelpText=""
LocFlyOverText="KatanaSpeedBonus" 
LocPromotionPopupText=""

[NinjatoSpeedBonus X2AbilityTemplate]
LocFriendlyName="NinjatoSpeedBonus"
LocLongDescription=""
LocHelpText=""
LocFlyOverText="NinjatoSpeedBonus" 
LocPromotionPopupText=""

[WakizashiSpeedBonus X2AbilityTemplate]
LocFriendlyName="WakizashiSpeedBonus"
LocLongDescription=""
LocHelpText=""
LocFlyOverText="WakizashiSpeedBonus" 
LocPromotionPopupText=""